In [1]:
import pandas as pd

In [39]:
# general practice - 1. Create a DataFrame from List
student_data = [[1, 15], [2, 11], [3, 11], [4, 20]]

df = pd.DataFrame(student_data,)
# df.rename(columns={0:'student_id', 1:'age'}) # this is alternate way
df.columns = ["student_id", "age"]
df

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

In [132]:
# 1. Create a DataFrame from List

def createDataframe(student_data) -> pd.DataFrame:
    column_names = ['student_id','age']
    df = pd.DataFrame(student_data, columns = column_names)
    return df

student_data = [[1, 15], [2, 11], [3, 11], [4, 20]]
createDataframe(student_data)

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

In [190]:
# general practice - 2. Get the Size of a DataFrame
excel_file = pd.ExcelFile("general_practice1.xlsx")
players = pd.read_excel(excel_file, 'players')
players

   player_id      name  age     position                team
0        846     Mason   21      Forward          RealMadrid
1        749     Riley   30       Winger           Barcelona
2        155       Bob   28      Striker    ManchesterUnited
3        583  Isabella   32   Goalkeeper           Liverpool
4        388   Zachary   24   Midfielder        BayernMunich
5        883       Ava   23     Defender             Chelsea
6        355    Violet   18      Striker            Juventus
7        247    Thomas   27      Striker  ParisSaint-Germain
8        761      Jack   33   Midfielder      ManchesterCity
9        642   Charlie   36  Center-back             Arsenal

In [192]:
players.shape

(10, 5)

In [196]:
# return the size as list
print(list(players.shape))

[10, 5]

In [158]:
# 2. Get the Size of a DataFrame
def getDataframeSize(players):
    df = pd.DataFrame(players)
    size = list(df.shape)
    return size

getDataframeSize(players)

[10, 5]

In [186]:
# general practice 3. Display the First Three Rows
excel_file = pd.ExcelFile("general_practice1.xlsx")
employees = pd.read_excel(excel_file, 'employees')
employees

   employee_id       name             department  salary
0            3        Bob             Operations   48675
1           90      Alice                  Sales   11096
2            9    Tatiana            Engineering   33805
3           60  Annabelle  InformationTechnology   37678
4           49   Jonathan         HumanResources   23793
5           43     Khaled         Administration   40454

In [188]:
employees.head(3)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

In [184]:
# 3. Display the First Three Rows
def selectFirstRows(employees):
    df = pd.DataFrame(employees)
    return df.head(3)
    
selectFirstRows(employees)

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805